schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void nextStation() {
    setStation(staMgnt.nextStation());
}
void nextFavStation() {
    setStation(staMgnt.nextFavStation());
}
void prevStation() {
    setStation(staMgnt.prevStation());
}
void prevFavStation() {
    setStation(staMgnt.prevFavStation());
}
void setStationByNumber(uint16_t staNr) {
    setStation(staMgnt.setStationByNumber(staNr));
}

void StationsItems() {
    if (!s_stationName_air) s_stationName_air = (char*)calloc(1, 1);
    char* stationLogo_air = x_ps_malloc(strlen(s_stationName_air) + 15);
    strcpy(stationLogo_air, "/logo/");
    strcat(stationLogo_air, s_stationName_air);
    strcat(stationLogo_air, ".jpg");
    char staNr[10];
    itoa(s_cur_station, staNr, 10);

    if (s_cur_station == 0) {
        webSrv.send("stationLogo=", stationLogo_air);
        webSrv.send("stationNr=", staNr);
        webSrv.send("stationURL=", s_settings.lastconnectedhost.get());
    } else {
        webSrv.send("stationLogo=", "/logo/" + String(staMgnt.getStationName(s_cur_station)) + ".jpg");
        webSrv.send("stationNr=", staNr);
        if (s_stationURL) webSrv.send("stationURL=", String(s_stationURL));
    }
    x_ps_free(&stationLogo_air);
}

void setStationViaURL(const char* url, const char* extension) {
    // e.g.  http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one&bitrate=96000
    // url is http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one, extension is bitrate=96000
    x_ps_free(&s_stationName_air);
    s_cur_station = 0;
    x_ps_free(&s_stationURL);
    int   len_url = strlen(url) + strlen(extension) + 3;
    char* origin_url = (char*)calloc(1, len_url);
    if (strlen(extension) > 0) {
        strcpy(origin_url, url);
        strcat(origin_url, "&");
        strcat(origin_url, extension);
    } else {
        strcpy(origin_url, url);
    }
    s_stationURL = x_ps_strdup(origin_url);
    connecttohost(origin_url);
    StationsItems();
    if (s_state == RADIO) {
        clearStreamTitle();
        showLogoAndStationName(true);
        dispFooter.updateFlag(NULL);
    }
    dispFooter.updateStation(0); // set 000
}

void savefile(const char* fileName, uint32_t contentLength) { // save the uploadfile on SD_MMC
    char fn[256];
    s_f_SD_Upload = false;
    if (!startsWith(fileName, "/")) {
        strcpy(fn, "/");
        strcat(fn, fileName);
    } else {
        strcpy(fn, fileName);
    }
    if (webSrv.uploadfile(SD_MMC, fn, contentLength)) {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
        webSrv.sendStatus(200);
    } else {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD failed", fn);
        webSrv.sendStatus(400);
    }
}

void saveImage(const char* fileName, uint32_t contentLength) { // save the jpg image on SD_MMC
    char fn[256];

    if (!s_f_SD_Upload && endsWith(fileName, "jpg")) {
        strcpy(fn, "/logo/");
        char prefix[03] = " /";
        prefix[0] = displayConfig.tftSize;
        strcat(fn, prefix);
        if (!startsWith(fileName, "/")) strcat(fn, "/");
        strcat(fn, fileName);
        if (webSrv.uploadB64image(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save image (jpg) " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        } else
            webSrv.sendStatus(400);
    }
}

String setI2STone() {
    int8_t LP = s_toneLP;
    int8_t BP = s_toneBP;
    int8_t HP = s_toneHP;
    int8_t BAL = s_toneBAL;
    audio.setTone(LP, BP, HP);
    audio.setBalance(BAL);
    sprintf(s_chbuf, "LowPass=%i\nBandPass=%i\nHighPass=%i\nBalance=%i\n", LP, BP, HP, BAL);
    String tone = String(s_chbuf);
    return tone;
}

void SD_playFile(const char* pathWoFileName, const char* fileName) { // pathWithoutFileName e.g. /audiofiles/playlist/
    sprintf(s_chbuf, "%s%s", pathWoFileName, fileName);
    int32_t idx = indexOf(s_chbuf, "\033[", 1);
    if (idx == -1) {
        ;
    } // do nothing
    else {
        s_chbuf[idx] = '\0';
    } // remove color and filesize
    SD_playFile(s_chbuf, 0, true);
}

void SD_playFile(const char* path, uint32_t fileStartTime, bool showFN) {
    if (!path) return;                            // avoid a possible crash
    if (endsWith(path, "ogg")) fileStartTime = 0; // resume only mp3, m4a, flac and wav
    if (endsWith(path, "m3u")) {
        if (SD_MMC.exists(path)) {
            preparePlaylistFromFile(path);
            processPlaylist(true);
        }
        return;
    }
    if (s_playerSubMenue != 1 && s_playerSubMenue != 3) {
        s_playerSubMenue = 1;
        changeState(PLAYER);
    }
    int32_t idx = lastIndexOf(path, '/');
    if (idx < 0) return;
    x_ps_free(&s_cur_AudioFolder);
    s_cur_AudioFolder = strdup(path);
    s_cur_AudioFolder[idx] = '\0';

    if (showFN) {
        clearLogo();
        showFileName(path + idx + 1);
    }

    SerialPrintfln("AUDIO_FILE:  " ANSI_ESC_MAGENTA "%s", path + idx + 1);
    connecttoFS("SD_MMC", (const char*)path, fileStartTime);
    if (s_f_playlistEnabled) showPlsFileNumber();
    if (s_f_isFSConnected) { s_settings.lastconnectedfile.copy_from(path); }
}

bool SD_rename(const char* src, const char* dest) {
    bool success = false;
    if (SD_MMC.exists(src)) {
        log_i("exists");
        success = SD_MMC.rename(src, dest);
    }
    return success;
}

bool SD_newFolder(const char* folderPathName) {
    bool success = false;
    success = SD_MMC.mkdir(folderPathName);
    return success;
}

bool SD_delete(const char* itemPath) {
    bool success = false;
    if (SD_MMC.exists(itemPath)) {
        File dirTest = SD_MMC.open(itemPath, "r");
        bool isDir = dirTest.isDirectory();
        dirTest.close();
        if (isDir)
            success = SD_MMC.rmdir(itemPath);
        else
            success = SD_MMC.remove(itemPath);
    }
    return success;
}

void fall_asleep() {
    s_f_sleeping = true;
    s_f_mute = true;
    s_f_playlistEnabled = false;
    s_f_isFSConnected = false;
    s_f_isWebConnected = false;
    audio.stopSong();
    if (s_sleepMode == 0) {
        clearAll();
        setTFTbrightness(0);
    } else {
        s_clockSubMenue = 0;
        changeState(CLOCK);
    }
    if (s_bt_emitter.power_state) bt_emitter.power_off();
    SerialPrintfln("falling asleep");
    dispHeader.hide();
    dispFooter.hide();
}

