schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
            if (s_state == CLOCK) {
                if (s_clockSubMenue == 2) { // scroll backward (alarm, radio, mute, off)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_CL_alarm.showAlternativePic();
                        btn_CL_radio.show();
                    }
                    if (btnNr == 1) {
                        btn_CL_radio.showAlternativePic();
                        btn_CL_mute.show();
                    }
                    if (btnNr == 2) {
                        btn_CL_mute.showAlternativePic();
                        btn_CL_off.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == ALARMCLOCK) {
                if (s_alarmSubMenue == 1) { // scroll backward (left, right, up, down, ready)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_AC_left.showAlternativePic();
                        btn_AC_right.show();
                    }
                    if (btnNr == 1) {
                        btn_AC_right.showAlternativePic();
                        btn_AC_up.show();
                    }
                    if (btnNr == 2) {
                        btn_AC_up.showAlternativePic();
                        btn_AC_down.show();
                    }
                    if (btnNr == 3) {
                        btn_AC_down.showAlternativePic();
                        btn_AC_ready.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == SLEEPTIMER) {
                if (s_sleepTimerSubMenue == 1) { // scroll backward (up, down, ready, cancel)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_SL_up.showAlternativePic();
                        btn_SL_down.show();
                    }
                    if (btnNr == 1) {
                        btn_SL_down.showAlternativePic();
                        btn_SL_ready.show();
                    }
                    if (btnNr == 2) {
                        btn_SL_ready.showAlternativePic();
                        btn_SL_cancel.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == SETTINGS) {
                if (s_settingsSubMenue == 1) { // scroll forward (bright, equal, radio)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_SE_bright.showAlternativePic();
                        btn_SE_equal.show();
                    }
                    if (btnNr == 1) {
                        btn_SE_equal.showAlternativePic();
                        btn_SE_wifi.show();
                    }
                    if (btnNr == 2) {
                        btn_SE_wifi.showAlternativePic();
                        btn_SE_radio.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == BRIGHTNESS) {
                if (s_brightnessSubMenue == 1) {
                    if (s_brightness > 5) s_brightness -= 5;
                    if (s_brightness < 5) s_brightness = 5;
                    sdr_BR_value.setValue(s_brightness);
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == EQUALIZER) {
                if (s_equalizerSubMenue == 1) {
                    char c[10];
                    if (btnNr == 10) {
                        if (s_toneBAL > -16) {
                            s_toneBAL--;
                            itoa(s_toneBAL, c, 10);
                            txt_EQ_balance.writeText(c);
                            sdr_EQ_balance.setValue(s_toneBAL);
                        }
                        webSrv.send("settone=", setI2STone());
                        setTimeCounter(2);
                        return;
                    } // balance
                    if (btnNr == 20) {
                        if (s_toneLP > -40) {
                            s_toneLP--;
                            itoa(s_toneLP, c, 10);
                            txt_EQ_lowPass.writeText(c);
                            sdr_EQ_lowPass.setValue(s_toneLP);
                        }
                        webSrv.send("settone=", setI2STone());
                        setTimeCounter(2);
                        return;
                    } // LP
                    if (btnNr == 30) {
                        if (s_toneBP > -40) {
                            s_toneBP--;
                            itoa(s_toneBP, c, 10);
                            txt_EQ_bandPass.writeText(c);
                            sdr_EQ_bandPass.setValue(s_toneBP);
                        }
                        webSrv.send("settone=", setI2STone());
                        setTimeCounter(2);
                        return;
                    } // BP
                    if (btnNr == 40) {
                        if (s_toneHP > -40) {
                            s_toneHP--;
                            itoa(s_toneHP, c, 10);
                            txt_EQ_highPass.writeText(c);
                            sdr_EQ_highPass.setValue(s_toneHP);
                        }
                        webSrv.send("settone=", setI2STone());
                        setTimeCounter(2);
                        return;
                    } // HP
                    if (btnNr == 1) {
                        btnNr = 0;
                        btn_EQ_Player.show();
                        btn_EQ_Radio.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 2) {
                        btnNr = 1;
                        btn_EQ_mute.show();
                        btn_EQ_Player.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                }
            }
            break;
        case 13: // ARROW DOWN
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == STATIONSLIST) {
                lst_RADIO.nextStation();
                setTimeCounter(LIST_TIMER);
                break;
            } // station++
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.nextFile();
                setTimeCounter(LIST_TIMER);
                break;
            } // file++
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                downvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME--
              //        if(s_state == DLNAITEMSLIST){lst_DLNA.nextItem(); setTimeCounter(LIST_TIMER); return;} // item++
            if (s_state == CLOCK) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == SLEEPTIMER) {
                downvolume();
                setTimeCounter(2);
                break;
            } // VOLUME--
            if (s_state == EQUALIZER && s_equalizerSubMenue == 1) {
                if (btnNr == 10) {
                    btnNr = 0;
                    btn_EQ_Radio.showAlternativePic();
                    btn_EQ_balance.show();
                } else if (btnNr == 20) {
                    btnNr = 10;
                    btn_EQ_balance.showAlternativePic();
                    btn_EQ_lowPass.show();
                } else if (btnNr == 30) {
                    btnNr = 20;
                    btn_EQ_lowPass.showAlternativePic();
                    btn_EQ_bandPass.show();
                } else if (btnNr == 40) {
                    btnNr = 30;
                    btn_EQ_bandPass.showAlternativePic();
                    btn_EQ_highPass.show();
                }
                setTimeCounter(2);
                return;
            }
            break;
        case 14: // ARROW UP
            if (s_state == RADIO) {
                txt_RA_staName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == STATIONSLIST) {
                lst_RADIO.prevStation();
                setTimeCounter(LIST_TIMER);
                break;
            } // station--
            if (s_state == PLAYER) {
                txt_PL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.prevFile();
                setTimeCounter(LIST_TIMER);
                break;
            } // file-
            if (s_state == DLNA) {
                txt_DL_fName.hide();
                volBox.enable();
                upvolume();
                volBox.setNumbers(s_volume.cur_volume);
                volBox.show();
                setTimeCounter(2);
                break;
            } // VOLUME++
              //            if(s_state == DLNAITEMSLIST){lst_DLNA.prevItem(); setTimeCounter(LIST_TIMER); return;} // item++
            if (s_state == CLOCK) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == SLEEPTIMER) {
                upvolume();
                setTimeCounter(2);
                break;
            } // VOLUME++
            if (s_state == EQUALIZER && s_equalizerSubMenue == 1) {
                if (btnNr < 10) {
                    btnNr = 10;
                    btn_EQ_balance.showAlternativePic();
                    btn_EQ_Radio.show();
                    btn_EQ_Player.show();
                    btn_EQ_mute.show();
                } else if (btnNr == 10) {
                    btnNr = 20;
                    btn_EQ_lowPass.showAlternativePic();
                    btn_EQ_balance.show();
                } else if (btnNr == 20) {
                    btnNr = 30;
                    btn_EQ_bandPass.showAlternativePic();
                    btn_EQ_lowPass.show();
                } else if (btnNr == 30) {
                    btnNr = 40;
                    btn_EQ_highPass.showAlternativePic();
                    btn_EQ_bandPass.show();
                }
                setTimeCounter(2);
                return;
            }
            break;
        case 15: // MODE
            if (s_state == SLEEPTIMER) {
                setStation(s_cur_station);
                s_radioSubMenue = 0;
                changeState(RADIO);
                break;
            } //  RADIO -> STATIONSLIST -> PLAYER -> DLNA -> CLOCK -> SLEEPTIMER
            if (s_state == RADIO) {
                changeState(STATIONSLIST);
                setTimeCounter(40);
                break;
            }
            if (s_state == STATIONSLIST) {
                s_playerSubMenue = 0;
                changeState(PLAYER);
                break;
            }
            if (s_state == PLAYER) {
                changeState(AUDIOFILESLIST);
                break;
            }
            if (s_state == AUDIOFILESLIST) {
                s_dlnaSubMenue = 0;
                changeState(DLNA);
                break;
            }
            if (s_state == DLNA) {
                s_clockSubMenue = 0;
                changeState(CLOCK);
                break;
            }
            if (s_state == CLOCK) {
                s_sleepTimerSubMenue = 0;
                changeState(SLEEPTIMER);
                break;
            }
            break;
        case 16: // OK
            if (s_state == RADIO) {
                if (s_radioSubMenue == 4) {
                    if (btnNr == 0) {
                        btn_RA_staList.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        changeState(STATIONSLIST);
                        setTimeCounter(LIST_TIMER);
                        break;
                    }
                    if (btnNr == 1) {
                        btn_RA_player.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_playerSubMenue = 2;
                        changeState(PLAYER);
                        setTimeCounter(2);
                        break;
                    }
                    if (btnNr == 2) {
                        btn_RA_dlna.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_dlnaSubMenue = 1;
                        changeState(DLNA);
                        setTimeCounter(2);
                        break;
                    }
                    if (btnNr == 3) {
                        btn_RA_clock.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_clockSubMenue = 2;
                        changeState(CLOCK);
                        setTimeCounter(2);
                        break;
                    }
                    if (btnNr == 4) {
                        btn_RA_sleep.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_sleepTimerSubMenue = 1;
                        changeState(SLEEPTIMER);
                        setTimeCounter(2);
                        break;
                    }
                    if (btnNr == 5) {
                        btn_RA_settings.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_settingsSubMenue = 1;
                        changeState(SETTINGS);
                        setTimeCounter(2);
                        break;
                    }
                    if (btnNr == 6) {
                        btn_RA_bt.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        changeState(BLUETOOTH);
                        break;
                    }
                    if (btnNr == 7) {
                        btn_RA_off.showClickedPic();
                        vTaskDelay(100);
                        fall_asleep();
                        break;
                    }
                } else {
                    s_radioSubMenue = 4;
                    btnNr = 0;
                    changeState(RADIO);
                }
                break;
            }
            if (s_state == STATIONSLIST) {
                setStationByNumber(lst_RADIO.getSelectedStation());
                s_radioSubMenue = 0;
                changeState(RADIO);
                break;
            }
            if (s_state == PLAYER) {
                if (s_playerSubMenue == 0) {
                    s_playerSubMenue = 2;
                    btnNr = 0;
                    changeState(PLAYER);
                    setTimeCounter(2);
                    break;
                }
                if (s_playerSubMenue == 1) {
                    s_playerSubMenue = 3;
                    btnNr = 0;
                    changeState(PLAYER);
                    setTimeCounter(2);
                    break;
                }
                if (s_playerSubMenue == 2) {
                    if (btnNr == 0) { // prev AudioFile
                        btn_PL_prevFile.showClickedPic();
                        vTaskDelay(50);
                        btn_PL_prevFile.showAlternativePic();
                        if (s_cur_AudioFileNr > 0) {
                            s_cur_AudioFileNr--;
                            showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                            showAudioFileNumber();
                            setTimeCounter(2);
                        }
                        return;
                    }
                    if (btnNr == 1) { // next AudioFile
                        btn_PL_nextFile.showClickedPic();
                        vTaskDelay(50);
                        btn_PL_nextFile.showAlternativePic();
                        if (s_cur_AudioFileNr + 1 < s_SD_content.getSize()) {
                            s_cur_AudioFileNr++;
                            showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                            showAudioFileNumber();
                            setTimeCounter(2);
                        }
                        return;
                    }
                    if (btnNr == 2) { // play file
                        btn_PL_ready.showClickedPic();
                        vTaskDelay(100);
                        stopSong();
                        SD_playFile(s_cur_AudioFolder, s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                        btnNr = 0;
                        s_playerSubMenue = 3;
                        changeState(PLAYER);
                        showAudioFileNumber();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 3) { // play all files
                        btn_PL_playAll.showClickedPic();
                        s_f_shuffle = false;
                        preparePlaylistFromSDFolder(s_cur_AudioFolder);
                        processPlaylist(true);
                        s_playerSubMenue = 1;
                        changeState(PLAYER);
                        return;
                    }
                    if (btnNr == 4) { // shuffle and play all files
                        btn_PL_shuffle.showClickedPic();
                        vTaskDelay(100);
                        s_f_shuffle = true;
                        preparePlaylistFromSDFolder(s_cur_AudioFolder);
                        processPlaylist(true);
                        s_playerSubMenue = 1;
                        changeState(PLAYER);
                        return;
                    }
                    if (btnNr == 5) { // show file list
                        btn_PL_fileList.showClickedPic();
                        vTaskDelay(100);
                        s_SD_content.listFilesInDir(s_cur_AudioFolder, true, false);
                        changeState(AUDIOFILESLIST);
                        return;
                    }
                    if (btnNr == 6) { // back to radio
                        btn_PL_radio.showClickedPic();
                        vTaskDelay(100);
                        setStation(s_cur_station);
                        s_playerSubMenue = 0;
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                        return;
                    }
                    if (btnNr == 7) { // off
                        btn_PL_off.showClickedPic();
                        vTaskDelay(100);
                        fall_asleep();
                        return;
                    }
                }
                if (s_playerSubMenue == 3) {
                    if (btnNr == 0) { // mute
                        btn_PL_mute.showClickedPic();
                        muteChanged(!s_f_mute);
                        vTaskDelay(100);
                        btn_PL_mute.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 1) { // pause
                        btn_PL_pause.showClickedPic();
                        if (s_f_isFSConnected) {
                            s_f_pauseResume = audio.pauseResume();
                            if (!audio.isRunning())
                                btn_PL_pause.setOn();
                            else
                                btn_PL_pause.setOff();
                        }
                        vTaskDelay(100);
                        btn_PL_pause.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 2) { // cancel
                        btn_PL_cancel.showClickedPic();
                        vTaskDelay(100);
                        btnNr = 0;
                        s_playerSubMenue = 2;
                        stopSong();
                        changeState(PLAYER);
                        return;
                    }
                    if (btnNr == 3) { // prev
                        btn_PL_playPrev.showClickedPic();
                        vTaskDelay(100);
                        btn_PL_playPrev.showAlternativePic();
                        s_cur_AudioFileNr = s_SD_content.getPrevAudioFile(s_cur_AudioFileNr);
                        SD_playFile(s_cur_AudioFolder, s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                        showAudioFileNumber();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 4) { // next
                        btn_PL_playNext.showClickedPic();
                        vTaskDelay(100);
                        btn_PL_playNext.showAlternativePic();
                        s_cur_AudioFileNr = s_SD_content.getNextAudioFile(s_cur_AudioFileNr);
                        SD_playFile(s_cur_AudioFolder, s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                        showAudioFileNumber();
                        setTimeCounter(2);
                        return;
                    }
                }
            }
            if (s_state == AUDIOFILESLIST) {
                const char* r = lst_PLAYER.getSelectedFile();
                if (r) {
                    stopSong();
                    SD_playFile(lst_PLAYER.getSelectedFilePath(), 0, true);
                    s_cur_AudioFileNr = lst_PLAYER.getSelectedFileNr();
                }
            }
            if (s_state == DLNA) {
                if (s_dlnaSubMenue == 0) {
                    s_dlnaSubMenue = 1;
                    btnNr = 0;
                    changeState(DLNA);
                    setTimeCounter(2);
                    break;
                }
                if (s_dlnaSubMenue == 1) {
                    if (btnNr == 0) { // mute
                        btn_DL_mute.showClickedPic();
                        muteChanged(!s_f_mute);
                        vTaskDelay(100);
                        btn_DL_mute.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 1) { // pause
                        if (!btn_DL_pause.getActive()) {
                            setTimeCounter(2);
                            return;
                        } // is inactive
                        btn_DL_pause.showClickedPic();
                        if (s_f_isWebConnected) {
